; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (arm-empty)
    (holding ?x - block)
    (clear ?x - block)
    (on ?x - block ?y - block)
    (on-table ?x - block)
  )

  (:action pickup
    :parameters (?x - block)
    :precondition (and (arm-empty) (clear ?x) (on-table ?x))
    :effect (and (not (arm-empty)) (holding ?x) (not (clear ?x)) (not 
(on-table ?x)))
  )

  (:action putdown
    :parameters (?x - block)
    :precondition (holding ?x)
    :effect (and (arm-empty) (not (holding ?x)) (clear ?x) (on-table ?x))
  )

  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (arm-empty) (not (holding ?x)) (on ?x ?y) (clear ?x) (not 
(clear ?y)))
  )

  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (arm-empty) (on ?x ?y) (clear ?x))
    :effect (and (not (arm-empty)) (holding ?x) (clear ?y) (not (clear 
?x)) (not (on ?x ?y)))
  )
)

; problem
(define (problem tower-reversal)
  (:domain blocksworld-4ops)
  (:objects A B C - block)
  (:init (arm-empty)
         (on-table A) (on B A) (on C B)
         (clear C))
  (:goal (and (on-table C) (on B C) (on A B))))

; plan
1. (unstack c b)
   deleted: (arm-empty) (clear c) (on c b)
   added: (holding c) (clear b)
   goals met: 0 of 3
2. (putdown c)
   deleted: (holding c)
   added: (arm-empty) (clear c) (on-table c)
   goals met: 1 of 3
3. (unstack b a)
   deleted: (arm-empty) (clear b) (on b a)
   added: (holding b) (clear a)
   goals met: 1 of 3
4. (stack b c)
   deleted: (holding b) (clear c)
   added: (arm-empty) (on b c) (clear b)
   goals met: 2 of 3
5. (pickup a)
   deleted: (arm-empty) (clear a) (on-table a)
   added: (holding a)
   goals met: 2 of 3
6. (stack a b)
   deleted: (holding a) (clear b)
   added: (arm-empty) (on a b) (clear a)
   goals met: 3 of 3
